Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The Microcks Quarkus extension includes a Microcks Dev Service. The Dev Service manages mocks for dependencies and contract-testing your API endpoints. See the extension https://github.com/microcks/microcks-quarkus[README.md] for more information.
ja_jp: Microcks Quarkusエクステンションには、Microcks Dev Serviceが含まれています。Dev Serviceは、依存関係のモックを管理し、APIエンドポイントのコントラクトテストを行います。 詳細については、エクステンションの link:https://github.com/microcks/microcks-quarkus[README.md] を参照してください。

source: The Micrometer Prometheus MeterRegistry extension creates an endpoint we can use to observe collected metrics. Let's take a look at the metrics that have been collected:
ja_jp: Micrometer Prometheus MeterRegistry エクステンションは、収集されたメトリクスの観察に使用できるエンドポイントを作成します。収集されたメトリクスを見てみましょう。

source: The Micrometer extension automatically times HTTP server requests.
ja_jp: Micrometer エクステンションは、HTTP サーバーリクエストの時間を自動的に計測します。

source: The Micrometer extension automatically times HTTP server requests. Following Prometheus naming conventions for timers, look for `http_server_requests_seconds_count`, `http_server_requests_seconds_sum`, and `http_server_requests_seconds_max`. Dimensional labels have been added for the requested uri, the HTTP method (GET, POST, etc.), the status code (200, 302, 404, etc.), and a more general outcome field.
ja_jp: Micrometer エクステンションは、HTTP サーバーのリクエストの時間を自動的に計測します。Prometheus のタイマーの命名規則に従い、`http_server_requests_seconds_count`、`http_server_requests_seconds_sum`、`http_server_requests_seconds_max` を参照してください。要求された URI、HTTP メソッド (GET、POST など)、ステータスコード (200、302、404 など)、そしてより一般的な結果フィールドのための次元ラベルが追加されました。

source: The Micrometer extension got its fair share of improvements (e.g. new registries)
ja_jp: Micrometer のエクステンションは、かなりの部分で改善されています(新しいレジストリーなど)

source: The Micrometer extension is maturing
ja_jp: Micrometer エクステンションの発展

source: The Micrometer metrics report key metrics from Netty's allocator, helping monitor memory usage, pinned memory, pooling efficiency, and cache behavior.
ja_jp: Micrometerメトリクスは、Nettyのアロケーターからの主要なメトリクスを報告し、メモリ使用量、固定メモリ、プーリング効率、キャッシュ動作の監視に役立ちます。

source: The Micrometer to OpenTelemetry bridge unifies all telemetry in Quarkus. It generates Micrometer's metrics but sends them along the OpenTelemetry telemetry output. For more details please visit the xref:telemetry-micrometer-to-opentelemetry.adoc[Micrometer and OpenTelemetry extension].
ja_jp: Micrometer から OpenTelemetry へのブリッジは、Quarkus のすべてのテレメトリーを統合します。これは Micrometer のメトリクスを生成しますが、それらを OpenTelemetry テレメトリー出力とともに送信します。詳細については、 xref:telemetry-micrometer-to-opentelemetry.adoc[Micrometer および OpenTelemetry エクステンション] を参照してください。

source: The Microprofile OpenAPI specification defines that *one* OASFilter implementation can be specified using the `mp.openapi.filter` configuration property. This filter will be run during RunStage `RUN`.
ja_jp: MicroProfile OpenAPI 仕様では、`mp.openapi.filter` 設定プロパティーを使用して *1つ* の OASFilter 実装を指定できると定義されています。このフィルターは RunStage `RUN` 中に実行されます。

source: The Microsoft Native Tools for Visual Studio must first be initialized before packaging. You can do this by starting the `x64 Native Tools Command Prompt` that was installed with the Visual Studio Build Tools. At the `x64 Native Tools Command Prompt`, you can navigate to your project folder and run `./mvnw package -Dnative`.
ja_jp: Visual Studio の Microsoft Native Tools はパッケージ化する前に初期化する必要があります。 これは、Visual Studio ビルドツールと一緒にインストールされた `x64 Native Tools Command Prompt` を起動することで行うことができます。 `x64 Native Tools Command Prompt` で、プロジェクトフォルダーに移動して `./mvnw package -Dnative` を実行してください。

source: The Microsoft Native Tools for Visual Studio must first be initialized before packaging. You can do this by starting the `x64 Native Tools Command Prompt` that was installed with the Visual Studio Build Tools. At `x64 Native Tools Command Prompt` you can navigate to your project folder and run `mvnw package -Pnative`.
ja_jp: Visual Studio の Microsoft Native Tools はパッケージングを行う前に、初期化する必要があります。これは、Visual Studio ビルドツールと一緒にインストールされた `x64 Native Tools Command Prompt` を起動することで行うことができます。 `x64 Native Tools Command Prompt` で、プロジェクト・フォルダーに移動して `mvnw package -Pnative` を実行してください。

source: The Microsoft SQL Server JDBC driver works essentially the same as the others.
ja_jp: Microsoft SQL Server JDBC ドライバーは、基本的に他のドライバーと同じように動作します。

source: The Microsoft SQL Server JDBC driver works essentially the same as the others. More details can be found in the https://docs.microsoft.com/en-us/sql/connect/jdbc/connecting-to-sql-server-with-the-jdbc-driver?view=sql-server-2017[official documentation].
ja_jp: Microsoft SQL Server JDBC ドライバーは基本的に他のものと同じように動作します。詳細は link:https://docs.microsoft.com/en-us/sql/connect/jdbc/connecting-to-sql-server-with-the-jdbc-driver?view=sql-server-2017[公式ドキュメント] に記載されています。

source: The Microsoft SQL Server Testcontainer doesn't support defining the username or database name. It also requires a strong password.
ja_jp: Microsoft SQL Server Testcontainer は、ユーザー名やデータベース名の定義に対応していません。また、強力なパスワードが必要です。

source: The Mongo Client does not attempt to connect to Mongo during application startup.
ja_jp: アプリケーションの起動中に Mongo クライアントは Mongo への接続を試みません。

source: The Mongo Client does not contribute a <<mongo-health-check,health check>>.
ja_jp: Mongo クライアントは <<mongo-health-check,ヘルスチェック>> に寄与しません。

source: The MongoDB Dev Service will be enabled when the `quarkus-mongodb-client` extension is present in your application, and the server address has not been explicitly configured. More information can be found at the xref:mongodb.adoc#dev-services[MongoDB Guide].
ja_jp: MongoDB Dev Serviceが有効になるのは、アプリケーションに `quarkus-mongodb-client` エクステンションがあり、サーバーアドレスが明示的に設定されていない場合です。詳細は link:mongodb.html#dev-services[MongoDB ガイド]を参照してください。

source: The MongoDB Dev Service will be enabled when the `quarkus-mongodb-client` extension is present in your application, and the server address has not been explicitly configured. More information can be found in the xref:mongodb-dev-services.adoc[MongoDB Guide].
ja_jp: MongoDB Dev Service が有効になるのは、 `quarkus-mongodb-client` エクステンションがアプリケーションにあり、サーバーアドレスが明示的に設定されていない場合です 。詳しくは xref:mongodb-dev-services.adoc[MongoDBガイド] を参照ください。

source: The MongoDB Dev Service will be enabled when the `quarkus-mongodb-client` extension is present in your application, and the server address has not been explicitly configured. More information can be found in the xref:mongodb.adoc#dev-services[MongoDB Guide].
ja_jp: MongoDB Dev Serviceが有効になるのは、アプリケーションに `quarkus-mongodb-client` エクステンションがあり、サーバーアドレスが明示的に設定されていない場合です。詳細は link:mongodb.html#dev-services[MongoDB ガイド]を参照してください。

source: The MongoDB Dev Services supports xref:compose-dev-services.adoc[Compose Dev Services]. It relies on a `compose-devservices.yml`, such as:
ja_jp: MongoDB Dev Services は xref:compose-dev-services.adoc[Compose Dev Services] をサポートしています。 これは `compose-devservices.yml` に依存しています：

source: The MongoDB extension: exposes an imperative and reactive (Mutiny) APIs to interact with MongoDB.
ja_jp: MongoDBエクステンション: MongoDBと対話するための命令型およびリアクティブ型（Mutiny）のAPIを公開しています。

source: The MongoDB reactive client uses Mutiny reactive types. If you are not familiar with Mutiny, check xref:mutiny-primer.adoc[Mutiny - an intuitive reactive programming library].
ja_jp: MongoDBのリアクティブ・クライアントは、Mutinyのリアクティブ・タイプを使用しています。Mutinyに慣れていない方は、 link:mutiny-primer.html[Mutiny - an intuitive reactive programming library]をご覧ください。

source: The Mutiny API has been tailored to improve the readability and maintenance of the codebase. Mutiny provides everything you need to orchestrate asynchronous actions, including concurrent execution. It also offers a large set of operators to manipulate individual events and streams of events.
ja_jp: MutinyのAPIは、コードベースの読みやすさとメンテナンス性を向上させるために調整されています。Mutinyは、同時実行を含む非同期アクションを組織化するために必要なすべてを提供します。また、個々のイベントやイベントのストリームを操作するための大規模な演算子のセットも提供しています。

source: The Mutiny event-driven paradigm is tailored for this. When the I/O operation completes successfully, the Uni that represents it emits an item event. When it fails, it emits a failure event. The continuation is simply and naturally expressed using the event-driven API.
ja_jp: Mutinyのイベントドリブンパラダイムは、これに合わせて作られています。I/O操作が正常に完了すると、それを表現するUniはアイテムイベントをエミットします。それが失敗すると、それは失敗イベントをエミットします。継続は、イベントドリブンなAPIを使ってシンプルかつ自然に表現されます。

source: The Mutiny variant does not only apply the rules exposed in the previous section. For asynchronous methods, it also provides:
ja_jp: Mutiny版は、前のセクションで公開されたルールを適用するだけではありません。非同期メソッドに対しても提供します:

source: The NVD CPE team updates the list regularly, but if you encounter a false positive, report the details by creating an issue in the link:https://github.com/quarkusio/quarkus/issues/2611[quarkusio] repository.
ja_jp: NVD CPEチームは定期的にリストを更新していますが、誤検出が発生した場合は、 link:https://github.com/quarkusio/quarkus/issues/2611[quarkusio] リポジトリにissueを作成して詳細を報告してください。

source: The Narayana LRA Dev Service will be enabled when the `quarkus-narayana-lra` extension is present in your application, and the coordinator URL has not been explicitly configured. More information can be found in the xref:lra-dev-services.adoc[Narayana LRA Dev Services Guide].
ja_jp: Narayana LRA Dev Service は、アプリケーションに `quarkus-narayana-lra` エクステンションが存在し、コーディネーター URL が明示的に設定されていない場合に有効になります。詳細は、 xref:lra-dev-services.adoc[Narayana LRA Dev Services Guide] を参照してください。

source: The Neo4j Dev Service will be enabled when the `quarkus-neo4j` extension is present in your application, and the server address has not been explicitly configured. More information can be found at the link:{neo4j-guide}#dev-services[Neo4j Guide].
ja_jp: Neo4j Dev Serviceは、アプリケーションに `quarkus-neo4j` エクステンションが存在し、サーバ・アドレスが明示的に設定されていない場合に有効になります。詳細は、 link:{neo4j-guide}#dev-services[Neo4jガイド]を参照してください。

source: The Neo4j Dev Service will be enabled when the `quarkus-neo4j` extension is present in your application, and the server address has not been explicitly configured. More information can be found in the link:{neo4j-guide}#dev-services[Neo4j Guide].
ja_jp: Neo4j Dev Serviceは、アプリケーションに `quarkus-neo4j` エクステンションが存在し、サーバ・アドレスが明示的に設定されていない場合に有効になります。詳細は、 link:{neo4j-guide}#dev-services[Neo4jガイド]を参照してください。

source: The Netty case is particularly interesting because it reads annotations to determine the capabilities of interface implementations.
ja_jp: Netty のケースは、インターフェースの実装の機能を判断するためにアノテーションを読み込んでいるため、特に興味深いものです。

source: The Netty problem
ja_jp: Nettyの問題

source: The November Newsletter has been published! This month, you can find articles about integration testing in Quarkus, how to use Quarkus and Google Cloud functions, as well as a piece about test-driven development with Quarkus.
ja_jp: 11月のニュースレターが発行されました! 今月は、Quarkusでの統合テスト、QuarkusとGoogle Cloud Functionsの使い方、さらにQuarkusでのテスト駆動開発に関する記事が掲載されています。

source: The OAuth token endpoint URL, such as `https://identity.api.openshift.com/auth/realms/rhoas/protocol/openid-connect/token`
ja_jp: OAuth トークンエンドポイント URL (例: `https://identity.api.openshift.com/auth/realms/rhoas/protocol/openid-connect/token`)

source: The OIDC Health check status is `UP` if at least one of the OIDC tenants has an `OK` status and `DOWN` otherwise.
ja_jp: OIDC ヘルスチェックのステータスは、少なくとも 1 つの OIDC テナントのステータスが `OK` であれば `UP` になり、それ以外の場合は `DOWN` になります。

source: The OIDC `web-app` application requires URLs of the OIDC provider's authorization, token, `JsonWebKey` (JWK) set, and possibly the `UserInfo`, introspection and end-session (RP-initiated logout) endpoints.
ja_jp: OIDC `web-app` アプリケーションは、OIDC プロバイダーの認可、トークン、 `JsonWebKey` （JWK）セット、そして場合によっては `UserInfo` 、イントロスペクション、セッション終了（RP-initiated logout）エンドポイントの URL を必要とします。

source: The OIDC `web-app` application requires URLs of the OIDC provider's authorization, token, `JsonWebKey` (JWK) set, and possibly the `UserInfo`, introspection, and end session (RP-initiated logout) endpoints.
ja_jp: OIDC `web-app` アプリケーションは、OIDC プロバイダーの認可、トークン、 `JsonWebKey` (JWK)セット、および場合によっては `UserInfo` 、イントロスペクション、エンドセッション（RP-initiated logout）エンドポイントの URL を必要とします。

source: The OIDC `web-app` application requires URLs of the OIDC provider's authorization, token, `JsonWebKey` (JWK) set, and possibly the `UserInfo`, introspection, and end-session (RP-initiated logout) endpoints.
ja_jp: OIDC の `web-app` アプリケーションには、OIDC プロバイダーの認可、トークン、 `JsonWebKey` (JWK) セット、そして場合によっては `UserInfo`、イントロスペクション、およびセッション終了 (RP 開始ログアウト) エンドポイントの URL が必要です。

source: The OIDC `web-app` application usually uses the access token to access other endpoints on behalf of the currently logged-in user. You can access the raw access token as follows:
ja_jp: OIDC `web-app` アプリケーションは通常、アクセストークンを使用して、現在ログインしているユーザーに代わって他のエンドポイントにアクセスします。 raw アクセストークンには次のようにアクセスできます。

source: The OIDC adapter uses cookies to keep the session, code flow and post logout state.
ja_jp: OIDCアダプターは、セッション、コードフロー、ログアウト後の状態を保持するためにクッキーを使用します。

source: The OIDC adapter uses cookies to keep the session, code flow, and post-logout state. This state is a key element controlling the lifetime of authentication data.
ja_jp: OIDC アダプターはクッキーを使用して、セッション、コードフロー、ログアウト後の状態を保持します。 この状態は、認証データの寿命を制御する重要な要素です。

source: The OIDC authentication mechanism can be affected if your Quarkus application is running behind a reverse proxy, gateway, or firewall when HTTP `Host` header might be reset to the internal IP address and HTTPS connection might be terminated, and so on. For example, an authorization code flow `redirect_uri` parameter might be set to the internal host instead of the expected external one.
ja_jp: Quarkus アプリケーションがリバースプロキシー、ゲートウェイ、またはファイアウォールの背後で実行されている場合に、HTTP `Host` ヘッダーが内部 IP アドレスにリセットされたり、HTTPS 接続が終端されたりするなどして、OIDC 認証メカニズムが影響を受けることがあります。 たとえば、認可コードフローの `redirect_uri` パラメーターが、予期される外部ホストではなく内部ホストに設定されている場合があります。

source: The OIDC authentication mechanism can be affected if your Quarkus application is running behind a reverse proxy, gateway, or firewall, where the HTTP `Host` header might be reset to the internal IP address, the HTTPS connection might be terminated, and so on.
ja_jp: Quarkus アプリケーションがリバースプロキシー、ゲートウェイ、またはファイアウォールの背後で実行されている場合に、HTTP `Host` ヘッダーが内部 IP アドレスにリセットされたり、HTTPS 接続が終了したりするなどして、OIDC 認証メカニズムが影響を受けることがあります。

source: The OIDC code authentication mechanism acquires three tokens during the authorization code flow: https://openid.net/specs/openid-connect-core-1_0.html#IDToken[ID token], access token, and refresh token.
ja_jp: OIDC コード認証メカニズムは、認可コードフロー中に 3 つのトークン https://openid.net/specs/openid-connect-core-1_0.html#IDToken[IDトークン]、アクセストークン、リフレッシュトークンを取得します。

source: The OIDC code authentication mechanism acquires three tokens during the authorization code flow: https://openid.net/specs/openid-connect-core-1_0.html#IDToken[IDToken], Access Token, and Refresh Token.
ja_jp: OIDCコード認証メカニズムは、認可コードフローの中で3つのトークンを取得します: link:https://openid.net/specs/openid-connect-core-1_0.html#IDToken[IDToken] 、Access Token、Refresh Tokenです。

source: The OIDC extension allows you to define the configuration by using the `application.properties` file in the `src/main/resources` directory.
ja_jp: OIDCエクステンションでは、 `src/main/resources` ディレクトリにある `application.properties` ファイルを使用して設定を定義できます。

source: The OIDC extension allows you to define the configuration using the `application.properties` file which should be located at the `src/main/resources` directory.
ja_jp: OIDCエクステンションでは、 `src/main/resources` ディレクトリにあるはずの `application.properties` ファイルを使用して設定を定義することができます。

source: The OIDC provider authenticates the user credentials entered and, if successful, issues an authorization code and redirects the user back to the Quarkus web-app with the code included as a query parameter.
ja_jp: OIDC プロバイダーは、入力されたユーザーのクレデンシャルを認証し、認証に成功すると認可コードを発行し、そのコードをクエリーパラメーターとして含めて Quarkus web-app にユーザーをリダイレクトします。

source: The OIDC provider authenticates the user credentials entered and, if successful, issues an authorization code then redirects the user back to the Quarkus web-app with the code included as a query parameter.
ja_jp: OIDCプロバイダは、入力されたユーザーの資格情報を認証し、成功すると認可コードを発行して、クエリパラメータとしてコードが含まれるQuarkus Web-appにユーザーをリダイレクトします。

source: The OIDC provider can force all applications to log out by using the authentication data. This is known as back-channel logout. In this case, OIDC will call a specific URL for each application to trigger the logout.
ja_jp: OIDC プロバイダーは、認証データを使用して、すべてのアプリケーションを強制的にログアウトさせることができます。 これはバックチャネルログアウトとして知られています。 この場合、OIDC は各アプリケーションから特定の URL を呼び出し、ログアウトをトリガーします。

source: The OIDC provider can force the logout of all applications by using the authentication data. This is known as back-channel logout. In this case, the OIDC will call a specific URL from each application to trigger that logout.
ja_jp: OIDC プロバイダは、認証データを使用して、すべてのアプリケーションを強制的にログアウトさせることができます。 これはバックチャネルログアウトとして知られています。 この場合、OIDC は各アプリケーションから特定の URL を呼び出し、ログアウトをトリガーします。

source: The OIDC provider externally-accessible authorization, logout, and other endpoints can have different HTTP(S) URLs compared to the URLs auto-discovered or configured relative to the `quarkus.oidc.auth-server-url` internal URL. In such cases, the endpoint might report an issuer verification failure and redirects to the externally-accessible OIDC provider endpoints might fail.
ja_jp: OIDC プロバイダーの外部からアクセス可能な認可、ログアウト、およびその他のエンドポイントは、自動検出された URL や内部 URL `quarkus.oidc.auth-server-url` とは異なる HTTP(S) URL を持つ場合があります。 このような場合、エンドポイントは発行者の検証の失敗を報告し、外部からアクセス可能な OIDC プロバイダーエンドポイントへのリダイレクトが失敗する可能性があります。

source: The OIDC provider externally-accessible authorization, logout, and other endpoints can have different HTTP(S) URLs compared to the URLs auto-discovered or configured relative to the `quarkus.oidc.auth-server-url` internal URL. In such cases, the endpoint might report an issuer verification failure, and redirects to externally accessible OIDC provider endpoints might fail.
ja_jp: OIDC プロバイダーの外部からアクセス可能な認可、ログアウト、およびその他のエンドポイントは、自動検出された URL や内部 URL `quarkus.oidc.auth-server-url` とは異なる HTTP(S) URL を持つ場合があります。 このような場合、エンドポイントは発行者の検証の失敗を報告し、外部からアクセス可能な OIDC プロバイダーエンドポイントへのリダイレクトが失敗する可能性があります。

source: The OIDC provider redirects the user to a login and authentication prompt.
ja_jp: OIDC プロバイダーは、ユーザーをログインと認証のプロンプトにリダイレクトします。

source: The Object Mapper is composed of 2 pieces:
ja_jp: Object Mapperは、2つのパーツから構成されています:

source: The Observability Dev Services will be enabled when the `quarkus-observability-devservices` extension is present in your application, and there is at least one dev resource on the classpath. More information can be found in the xref:observability-devservices.adoc[Observability Dev Services Guide].
ja_jp: Observability Dev Servicesは、 `quarkus-observability-devservices` エクステンションがアプリケーションに存在し、クラスパスに少なくとも1つのdevリソースがある場合に有効になります。 詳細は xref:observability-devservices.adoc[Observability Dev Services ガイド] を参照してください。

source: The October Newsletter has been published! This month, check out great articles to learn Quarkus Tips, Tricks and Techniques as well as Getting Started with Kubernetes-Native Java. Learn about Deploying a Quarkus GraalVM native application to IBM Cloud with GitOps. Read a great performance article for Building Native Java Apps with Quarkus and an article for Spring Developers:Kubernetes-native design patterns.
ja_jp: 10月のニュースレターが発行されました。今月は、Quarkusの豆知識、トリック、技術を学べる素晴らしい記事や、Kubernetes-Native Javaの入門をご紹介します。また、Quarkus GraalVM ネイティブアプリケーションをIBM CloudにGitOpsでデプロイする方法をご紹介します。QuarkusでネイティブなJavaアプリを構築するためのパフォーマンスに関する記事や、Spring Developers:Kubernetes-nativeのデザインパターンに関する記事もご覧ください。

source: The OpenID Connect extension allows you to define the adapter configuration using the `application.properties` file which should be located at the `src/main/resources` directory.
ja_jp: OpenID Connect エクステンションを使用すると、 `src/main/resources` ディレクトリーに配置される `application.properties` ファイルを使用してアダプター設定を定義することができます。

source: The OpenID Connect extension allows you to define the configuration using the `application.properties` file which should be located at the `src/main/resources` directory.
ja_jp: OpenID Connect エクステンションを使用すると、src/main/resources` ディレクトリーにあるはずの `application.properties` ファイルを使用して設定を定義することができます。

source: The OpenJDK community will end active support for Java 11 in September 2023. We still plan to support Java 11 past that date for core Quarkus functionality, but Java 11 is now marked as deprecated. We recommend that you upgrade to Java 17 or later if you want to use the latest and greatest version of Quarkus.
ja_jp: OpenJDKコミュニティは、2023年9月にJava 11のアクティブサポートを終了する予定です。Quarkusのコア機能については、この日付以降もJava 11をサポートする予定ですが、Java 11は現在、非推奨とマークされています。Quarkusの最新かつ最高のバージョンを使用したい場合は、Java 17以降にアップグレードすることをお勧めします。

source: The OpenShift extension allows the user to configure both volumes and mounts for the application.
ja_jp: OpenShiftエクステンションを使用すると、アプリケーションのボリュームとマウントの両方を設定することができます。

source: The OpenShift extension allows you to configure both volumes and mounts for the application. You can mount any volume with a simple configuration:
ja_jp: OpenShift エクステンションでは、アプリケーションのボリュームとマウントの両方を設定できます。 簡単な設定で任意のボリュームをマウントできます：

source: The OpenShift extension is configured to use xref:container-image.adoc#s2i[container-image-s2i]. However, it is still possible to use other container image extensions, such as:
ja_jp: OpenShift エクステンションは xref:container-image.adoc#s2i[container-image-s2i] を使用するように設定されています。しかし、以下のような他のコンテナイメージエクステンションを使用することも可能です：

source: The OpenShift resources can be customized in a similar approach with Kubernetes.
ja_jp: Kubernetesと同様のアプローチでOpenShiftのリソースをカスタマイズすることができます。

source: The OpenShift-specific DSL accessors won't be available since you'll now have a Bean of type `KubernetesClient` instead of `OpenShiftClient`. However, the Fabric8 Kubernetes Client provides generic entry-points to perform operations on any resource:
ja_jp: `OpenShiftClient` の代わりに `KubernetesClient` 型の Bean を持つことになるため、OpenShift 固有の DSL アクセサーは利用できなくなります。ただし、Fabric8 Kubernetes Client は、あらゆるリソースに対して操作を実行するための汎用的なエントリーポイントを提供します。

source: The OpenTelemetry API does not define annotations for metrics like Micrometer's `@Counted`, `@Timed` or `@MeterTag`. You need to manually create the metrics.
ja_jp: OpenTelemetry API は、Micrometer の `@Counted`、 `@Timed`、 `@MeterTag` などのメトリクスのアノテーションを定義しません。 メトリクスを手動で作成する必要があります。

source: The OpenTelemetry API provides a `Meter` interface to create metrics instead of a Registry. The `Meter` interface is the entry point for creating metrics. It provides methods to create counters, gauges, and histograms.
ja_jp: OpenTelemetry API は、レジストリーの代わりにメトリクスを作成するための `Meter` インターフェイスを提供します。 `Meter` インターフェイスは、メトリクスを作成するエントリーポイントです。 このインターフェイスにより、カウンター、ゲージ、ヒストグラムの作成メソッドが提供されます。

source: The OpenTelemetry OTLP exporter
ja_jp: OpenTelemetry OTLP エクスポーター

source: The OpenTelemetry extension has been rewritten to support the SDK autoconfiguration and went through many changes.
ja_jp: OpenTelemetryエクステンションは、SDK自動設定をサポートするために書き直され、多くの変更が行われました。

source: The OpenTelemetry extension stores the traces in the duplicated context, ensuring propagation even when using reactive and asynchronous code.
ja_jp: OpenTelemetry エクステンションは、複製コンテキストにトレースを保存するので、リアクティブで非同期なコードを使用しているときでも、確実に伝搬します。

source: The OpenTelemetry extension will use by default a random https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/trace/sdk.md#id-generators[ID Generator] when creating the trace and span identifier.
ja_jp: OpenTelemetry エクステンションでは、トレースおよびスパンの識別子を作成する際に、デフォルトでランダムな link:https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/trace/sdk.md#id-generators[ID ジェネレーター] を使用します。

source: The OpenTelemetry profiling signal, still under development, might be available in the future.
ja_jp: OpenTelemetry プロファイリングシグナルはまだ開発中ですが、将来利用可能になる可能性があります。

source: The OpenTelemetry tracer is not compatible with the OpenTracing API. The main changes are summarized in the following table:
ja_jp: OpenTelemetry トレーサーは OpenTracing API と互換性がありません。主な変更点を以下の表にまとめています。

source: The OpenTracing shim
ja_jp: OpenTracing シム

source: The Output
ja_jp: 出力
